app/Controllers/Usuarios.php

    public function index($activo = 1)
    {


        $usuarios = $this->usuarios->where('activo', $activo)->findAll();
---
SELECT *
FROM `usuarios`
WHERE `activo` = 1

    public function nuevo()
    {
        $cajas = $this->cajas->where('activo', 1)->findAll();
        $roles = $this->roles->where('activo', 1)->findAll();
---
SELECT *
FROM `cajas`
WHERE `activo` = 1
SELECT *
FROM `roles`
WHERE `activo` = 1